; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	infrared3 - mode
	image5 - mode
	image1 - mode
	infrared6 - mode
	spectrograph4 - mode
	spectrograph0 - mode
	thermograph2 - mode
	Star3 - direction
	Star5 - direction
	GroundStation8 - direction
	GroundStation10 - direction
	GroundStation2 - direction
	GroundStation7 - direction
	Star12 - direction
	GroundStation0 - direction
	Star11 - direction
	Star1 - direction
	Star9 - direction
	Star4 - direction
	GroundStation6 - direction
	Star13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 thermograph2)
	(supports instrument0 infrared6)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 Star12)
	(calibration_target instrument0 GroundStation7)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation6)
	(supports instrument2 thermograph2)
	(supports instrument2 infrared3)
	(calibration_target instrument2 Star11)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument3 image1)
	(supports instrument3 thermograph2)
	(supports instrument3 image5)
	(supports instrument3 spectrograph4)
	(calibration_target instrument3 GroundStation6)
	(calibration_target instrument3 Star4)
	(calibration_target instrument3 Star9)
	(calibration_target instrument3 Star1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
)
(:goal (and
	(pointing satellite1 Planet15)
	(have_image Star13 spectrograph0)
	(have_image Star13 image5)
	(have_image Phenomenon14 infrared3)
	(have_image Phenomenon14 spectrograph4)
	(have_image Planet15 spectrograph4)
	(have_image Planet15 infrared3)
	(have_image Phenomenon16 spectrograph4)
))

)

; plan
1. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 8
2. (calibrate satellite1 instrument3 star4)
   added: (calibrated instrument3)
   goals met: 0 of 8
3. (turn_to satellite1 phenomenon14 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 phenomenon14)
   goals met: 0 of 8
4. (take_image satellite1 phenomenon14 instrument3 spectrograph4)
   added: (have_image phenomenon14 spectrograph4)
   goals met: 1 of 8
5. (turn_to satellite1 phenomenon16 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 phenomenon16)
   goals met: 1 of 8
6. (take_image satellite1 phenomenon16 instrument3 spectrograph4)
   added: (have_image phenomenon16 spectrograph4)
   goals met: 2 of 8
7. (turn_to satellite1 planet15 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 planet15)
   goals met: 3 of 8
8. (take_image satellite1 planet15 instrument3 spectrograph4)
   added: (have_image planet15 spectrograph4)
   goals met: 4 of 8
9. (turn_to satellite0 groundstation6 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 groundstation6)
   goals met: 4 of 8
10. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 4 of 8
11. (calibrate satellite0 instrument1 groundstation6)
   added: (calibrated instrument1)
   goals met: 4 of 8
12. (turn_to satellite0 groundstation0 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 groundstation0)
   goals met: 4 of 8
13. (turn_to satellite1 star13 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 star13)
   goals met: 3 of 8
14. (take_image satellite1 star13 instrument3 image5)
   added: (have_image star13 image5)
   goals met: 4 of 8
15. (turn_to satellite1 planet15 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 planet15)
   goals met: 5 of 8
16. (turn_to satellite0 star13 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star13)
   goals met: 5 of 8
17. (take_image satellite0 star13 instrument1 spectrograph0)
   added: (have_image star13 spectrograph0)
   goals met: 6 of 8
18. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 6 of 8
19. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 6 of 8
20. (turn_to satellite0 phenomenon14 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 phenomenon14)
   goals met: 6 of 8
21. (turn_to satellite0 star11 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 star11)
   goals met: 6 of 8
22. (calibrate satellite0 instrument2 star11)
   added: (calibrated instrument2)
   goals met: 6 of 8
23. (turn_to satellite0 phenomenon14 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 phenomenon14)
   goals met: 6 of 8
24. (take_image satellite0 phenomenon14 instrument2 infrared3)
   added: (have_image phenomenon14 infrared3)
   goals met: 7 of 8
25. (turn_to satellite0 planet15 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 planet15)
   goals met: 7 of 8
26. (take_image satellite0 planet15 instrument2 infrared3)
   added: (have_image planet15 infrared3)
   goals met: 8 of 8
